
/**
 * 预设数据定义
 * 格式：[列索引, 行索引]
 * 行 0 是最高音，行 15 是最低音
 */
export const PRESETS = {
    "Empty": [], // 清空画布
    "Techno Kick": [
        [0, 15], [4, 15], [8, 15], [12, 15] // 每四拍一个底鼓
    ],
    "Basic Scale": [
        [0, 15], [1, 14], [2, 13], [3, 12], [4, 11], [5, 10], [6, 9], [7, 8]
    ],
    "Ambient Pad": [
        [0, 4], [4, 4], [8, 4], [12, 4],
        [2, 7], [6, 7], [10, 7], [14, 7]
    ],
    "Broken Techno":[
        // 底鼓 (Kick) - 不均匀分布
        [0, 15], [3, 15], [6, 14], [10, 15], [13, 14],
        // 军鼓 (Snare) - 经典的切分位置
        [4, 8], [12, 8], [14, 9],
    ],
    "Industrial Glitch":[
        // 底鼓 (Kick) - 密集的双击开头，后面留空
        [0, 15], [1, 15], [7, 15], [8, 14],
        // 军鼓 (Snare) - 极其靠后的重音
        [4, 10], [10, 10], [13, 10], [15, 10],
        // 故障音 (Glitch/Chirps) - 极高音的不规则跳跃
        [2, 0], [3, 3], [5, 1], [6, 0], [9, 2], [11, 0], [12, 3], [14, 1]
    ]
};